'''Вам нужно посчитать сумму элементов двумерного квадратного (NxN) списка, которые расположены на главной диагонали.
Под главной диагональю матрицы подразумевается диагональ, проведённая из левого верхнего угла в правый нижний.
Отличительной особенностью элементов, расположенных на главной диагонали, является то, что у них номер строки совпадает с номером столбца. 
У всех остальных элементов матрицы номера строки и столбца различаются
Программа сперва принимает на вход число N (N<=15) - количество строк и столбцов в списке, а затем в N строках записаны элементы списка.

Sample Input 1:

2
1 2
3 4
'''
matrix = []
summa = 0
for i in range(n := int(input())):
    row = list(map(int, input().split()))
    matrix.append(row)

for i in range(n):
    for j in range(n):
      if i == j:
          summa += matrix[i][j]

print(summa)
